---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Stairs.NumberOfStories
zh: 楼梯
source: html/f8ac077d-035b-38d2-f669-642b6ae8c139.htm
---
# Autodesk.Revit.DB.Architecture.Stairs.NumberOfStories Property

**中文**: 楼梯

The number of stories of a multi-story stair, or 1 for a single-story stair.

## Syntax (C#)
```csharp
public int NumberOfStories { get; }
```